redisTestResult/redisMutiThreadsTestResult/redis_test_result_by_memtier_benchmark_FM_OFF_3nd/redis_result_Random110_FM_OFF_P3_3nd_20230717192928.log
20        Threads
5         Connections per thread
50        Seconds


ALL STATS
============================================================================================================================
Type         Ops/sec     Hits/sec   Misses/sec    Avg. Latency     p50 Latency     p99 Latency   p99.9 Latency       KB/sec 
----------------------------------------------------------------------------------------------------------------------------
Sets        25052.57          ---          ---         3.63648         3.45500         6.97500         9.15100     27058.73 
Gets         2504.27      2504.27         0.00         3.52419         3.45500         6.94300         8.76700      2692.58 
Waits           0.00          ---          ---             ---             ---             ---             ---          --- 
Totals      27556.84      2504.27         0.00         3.62627         3.45500         6.97500         9.08700     29751.31 


Request Latency Distribution
Type     <= msec         Percent
------------------------------------------------------------------------
SET       0.383        0.000
SET       2.959        5.000
SET       3.039       10.000
SET       3.119       15.000
SET       3.199       20.000
SET       3.263       25.000
SET       3.327       30.000
SET       3.359       35.000
SET       3.391       40.000
SET       3.423       45.000
SET       3.455       50.000
SET       3.471       52.500
SET       3.487       55.000
SET       3.503       57.500
SET       3.519       60.000
SET       3.535       62.500
SET       3.551       65.000
SET       3.583       67.500
SET       3.599       70.000
SET       3.631       72.500
SET       3.647       75.000
SET       3.663       76.250
SET       3.679       77.500
SET       3.695       78.750
SET       3.695       80.000
SET       3.711       81.250
SET       3.727       82.500
SET       3.743       83.750
SET       3.759       85.000
SET       3.791       86.250
SET       3.823       87.500
SET       3.855       88.125
SET       3.903       88.750
SET       3.999       89.375
SET       4.127       90.000
SET       4.191       90.625
SET       4.255       91.250
SET       4.319       91.875
SET       4.383       92.500
SET       4.447       93.125
SET       4.543       93.750
SET       4.575       94.062
SET       4.639       94.375
SET       4.703       94.688
SET       4.799       95.000
SET       4.863       95.312
SET       4.991       95.625
SET       5.183       95.938
SET       5.247       96.250
SET       5.343       96.562
SET       5.439       96.875
SET       5.503       97.031
SET       5.535       97.188
SET       5.631       97.344
SET       5.727       97.500
SET       5.887       97.656
SET       6.047       97.812
SET       6.207       97.969
SET       6.399       98.125
SET       6.591       98.281
SET       6.687       98.438
SET       6.751       98.516
SET       6.783       98.594
SET       6.815       98.672
SET       6.879       98.750
SET       6.911       98.828
SET       6.943       98.906
SET       6.975       98.984
SET       7.007       99.062
SET       7.039       99.141
SET       7.103       99.219
SET       7.103       99.258
SET       7.135       99.297
SET       7.199       99.336
SET       7.231       99.375
SET       7.263       99.414
SET       7.295       99.453
SET       7.327       99.492
SET       7.359       99.531
SET       7.391       99.570
SET       7.423       99.609
SET       7.455       99.629
SET       7.487       99.648
SET       7.487       99.668
SET       7.519       99.688
SET       7.551       99.707
SET       7.615       99.727
SET       7.679       99.746
SET       7.839       99.766
SET       8.063       99.785
SET       8.319       99.805
SET       8.383       99.814
SET       8.447       99.824
SET       8.511       99.834
SET       8.575       99.844
SET       8.639       99.854
SET       8.703       99.863
SET       8.831       99.873
SET       8.895       99.883
SET       9.023       99.893
SET       9.215       99.902
SET       9.279       99.907
SET       9.343       99.912
SET       9.407       99.917
SET       9.471       99.922
SET       9.599       99.927
SET       9.663       99.932
SET       9.791       99.937
SET       9.855       99.941
SET      10.047       99.946
SET      10.303       99.951
SET      10.367       99.954
SET      10.431       99.956
SET      10.431       99.958
SET      10.495       99.961
SET      10.559       99.963
SET      10.623       99.966
SET      10.687       99.968
SET      10.751       99.971
SET      10.815       99.973
SET      10.943       99.976
SET      11.007       99.977
SET      11.007       99.978
SET      11.071       99.979
SET      11.071       99.980
SET      11.135       99.982
SET      11.199       99.983
SET      11.263       99.984
SET      11.327       99.985
SET      11.327       99.987
SET      11.391       99.988
SET      11.583       99.988
SET      11.711       99.989
SET      11.775       99.990
SET      11.839       99.990
SET      11.967       99.991
SET      13.183       99.991
SET     757.759       99.992
SET     757.759       99.993
SET     757.759       99.993
SET     757.759       99.994
SET     757.759       99.994
SET     757.759       99.995
SET     757.759       99.995
SET     757.759       99.995
[...]
SET     757.759       99.996
SET     757.759       99.996
SET     757.759       99.996
SET     757.759       99.997
SET     757.759       99.997
SET     757.759       99.997
[...]
SET     757.759       99.998
SET     757.759       99.998
SET     757.759       99.998
[...]
SET     757.759       99.999
SET     757.759       99.999
SET     757.759       99.999
[...]
SET     757.759      100.000
SET     757.759      100.000
SET     757.759      100.000
[...]
SET     761.855      100.000
SET     761.855      100.000
SET     761.855      100.000
[...]
SET     765.951      100.000
SET     765.951      100.000
---
GET       1.247        0.000
GET       2.943        5.000
GET       3.039       10.000
GET       3.103       15.000
GET       3.183       20.000
GET       3.263       25.000
GET       3.311       30.000
GET       3.359       35.000
GET       3.391       40.000
GET       3.423       45.000
GET       3.455       50.000
GET       3.471       52.500
GET       3.471       55.000
GET       3.487       57.500
GET       3.503       60.000
GET       3.519       62.500
GET       3.535       65.000
GET       3.551       67.500
GET       3.583       70.000
GET       3.599       72.500
GET       3.615       75.000
GET       3.631       76.250
GET       3.647       77.500
GET       3.663       78.750
GET       3.679       80.000
GET       3.679       81.250
GET       3.695       82.500
GET       3.711       83.750
GET       3.727       85.000
GET       3.743       86.250
GET       3.775       87.500
GET       3.775       88.125
GET       3.791       88.750
GET       3.807       89.375
GET       3.839       90.000
GET       3.855       90.625
GET       3.903       91.250
GET       3.951       91.875
GET       4.015       92.500
GET       4.095       93.125
GET       4.159       93.750
GET       4.191       94.062
GET       4.223       94.375
GET       4.255       94.688
GET       4.287       95.000
GET       4.351       95.312
GET       4.383       95.625
GET       4.447       95.938
GET       4.479       96.250
GET       4.575       96.562
GET       4.703       96.875
GET       4.799       97.031
GET       4.927       97.188
GET       5.087       97.344
GET       5.247       97.500
GET       5.567       97.656
GET       5.919       97.812
GET       6.111       97.969
GET       6.271       98.125
GET       6.495       98.281
GET       6.655       98.438
GET       6.719       98.516
GET       6.751       98.594
GET       6.815       98.672
GET       6.847       98.750
GET       6.879       98.828
GET       6.911       98.906
GET       6.943       98.984
GET       6.975       99.062
GET       7.007       99.141
GET       7.039       99.219
GET       7.071       99.258
GET       7.103       99.297
GET       7.135       99.336
GET       7.167       99.375
GET       7.231       99.414
GET       7.263       99.453
GET       7.295       99.492
GET       7.327       99.531
GET       7.359       99.570
GET       7.423       99.609
GET       7.423       99.629
GET       7.455       99.648
GET       7.455       99.668
GET       7.487       99.688
GET       7.519       99.707
GET       7.551       99.727
GET       7.615       99.746
GET       7.711       99.766
GET       7.903       99.785
GET       8.127       99.805
GET       8.255       99.814
GET       8.319       99.824
GET       8.383       99.834
GET       8.447       99.844
GET       8.511       99.854
GET       8.511       99.863
GET       8.639       99.873
GET       8.639       99.883
GET       8.703       99.893
GET       8.831       99.902
GET       8.895       99.907
GET       8.895       99.912
GET       9.023       99.917
GET       9.087       99.922
GET       9.151       99.927
GET       9.279       99.932
GET       9.407       99.937
GET       9.471       99.941
GET       9.599       99.946
GET       9.791       99.951
GET       9.855       99.954
GET       9.919       99.956
GET      10.047       99.958
GET      10.175       99.961
GET      10.303       99.963
GET      10.367       99.966
GET      10.367       99.968
GET      10.431       99.971
GET      10.495       99.973
GET      10.623       99.976
GET      10.623       99.977
GET      10.687       99.978
GET      10.687       99.979
GET      10.687       99.980
GET      10.751       99.982
GET      10.751       99.983
GET      10.815       99.984
GET      10.815       99.985
GET      10.815       99.987
GET      10.879       99.988
GET      10.879       99.988
GET      10.943       99.989
GET      10.943       99.990
GET      10.943       99.990
GET      11.007       99.991
GET      11.135       99.991
GET      11.135       99.992
GET      11.135       99.993
GET      11.263       99.993
GET      11.327       99.994
GET      11.327       99.994
GET      11.327       99.995
GET      11.327       99.995
GET      11.327       99.995
[...]
GET      11.327       99.996
GET      11.455       99.996
GET      11.455       99.996
GET      11.455       99.997
GET      11.711       99.997
GET      11.711       99.997
GET      11.711       99.997
[...]
GET      11.711       99.998
GET      12.863       99.998
GET      12.863       99.998
GET      12.863       99.998
[...]
GET      13.311       99.998
GET      13.311       99.999
GET      13.311       99.999
GET      13.311       99.999
[...]
GET      14.911       99.999
GET      14.911      100.000
---
WAIT      0.000      100.000